Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes.FaceHatch Property
 The hatch type of the face hatch.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectHatchAttributes FaceHatch { get; set; }
Public Property FaceHatch As ModelObjectHatchAttributes
	Get
	Set
Property Value
Type: ModelObjectHatchAttributes
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace